export const defaultPosts = [
  {
    key: '1',
    id: '123',
    title: '宝妈日志|要搞学习就好好开始',
    content: '想着皮皮已经上幼儿园一段时间了，不久就要升小学，都是很重要的时期啊。毕竟好好学习的话每个阶段都要好好培养，并且习得良好的学习习惯。\n·\n其实也考虑过，“还在读幼儿园呢？有必要这么早就开始抓学习吗？也太浮夸了，大可不必急着学\'硬\'性知识。”\n·\n🔷要说皮皮在早教课上幼儿园里学到了多少考试知识，我觉得其实并没有，更多的是锻炼自主思维、养成良好行为习惯、培养生活能力和认知这些基础的东西。\n·\n当然也会有读绘本、识数字和字母、唱儿歌这些内容，皮皮还是很喜欢的。\n当他开始兴致满满地要做加减法算家里的苹果爸爸妈妈一人吃了一个之后还剩多少个，跟着早教视频读英语单词的时候，我就知道，这个时候，是可以“搞学习”了。\n·\n🔷综合各方面考虑，还是给他买了学习机，挑来挑去定了希沃网课学习机W1系列，15.6英寸的大屏，加上是立式设计，防眩光玻璃屏幕有多重护眼模式，看着光线柔和，用来学习网课早教视频很合适。\n·\n皮皮会比较喜欢我给他挑的学习视频，不是那种知识讲解，而是动画视频那种不缺乏趣味性的讲解。或者跟着英语AI指读单词，测评发音之后再自己改正。\n学习机本身的资源也丰富，有专门的微课、特色学科讲解，还可以自己下载想用得学习APP。儿童学习专区设计板块很不错~\n·\n当然，家长是可以管控学习机使用的啦，由于皮皮比较自觉，就没有怎么用。但是会经常拿来查查学习数据，设置学习时长这些，或者通过AI摄像头注意下学习动态，看皮皮有没有偏着歪着，要是不乖乖坐好的话会有AI坐姿提醒。\n·\n“学习机”作为一个可以为孩子学习提供一定辅助的机器，我可以！一起好好搞学习～\n❤️感谢希沃品牌赞助\n.\n亲子日常|早教学习|亲子早教|幼小衔接|学习机|萌娃日常',
    status: 0, // 0-offerline 1-online
    createUser: {
      userName: 'Bill',
    },
    follow: 100,
    like: 10,
    comment: 10000,
    images: [
      { url: 'http://image.biaobaiju.com/uploads/20180211/01/1518284524-CWaMdEHpmn.jpg' },
      { url: 'https://images.pexels.com/photos/2129796/pexels-photo-2129796.png?auto=compress&cs=tinysrgb&h=750&w=1260' },
      { url: 'https://images.pexels.com/photos/2129796/pexels-photo-2129796.png?auto=compress&cs=tinysrgb&h=750&w=1260' },
      { url: 'https://images.pexels.com/photos/2129796/pexels-photo-2129796.png?auto=compress&cs=tinysrgb&h=750&w=1260' },
    ],
    labels: [
      {
        id: '000000001',
        title: '热榜',
        describe: '标签描述',
        type: 0, // 0-首页标签，1-所有标签
      },
      {
        id: '000000002',
        title: '知识',
        describe: '标签描述2',
        type: 0, // 0-首页标签，1-所有标签
      },
      {
        id: '000000003',
        title: '职场',
        describe: '标签描述3',
        type: 0, // 0-首页标签，1-所有标签
      },
    ]
  },
  {
    key: '3',
    id: '789',
    title: '不能这么做！这些宝宝急救误区一定要避免',
    content: '今天来跟大家聊一聊居家带娃会遇到的急救问题~\n👉\n宝宝每天都上蹿下跳，无所畏惧。什么都想碰，什么都想看，什么都往嘴里塞，常常把自己置于“危险”而不自知。网上宝宝在家被烫伤、割伤、磕碰扭伤或者异物卡喉的新闻数不胜数。更有不少家长因为用错方法，导致孩子伤情加重。\n👇\n我今天盘点了一些急救误区，大家千万要避免！\n👉孩子被食物噎住怎么办？\n喂水、喝醋：❌❌❌\n食物很有可能只是卡在喉咙里，这时候给孩子喂水喝醋，液体会让食物发胀，可能会把异物和气管之间的缝隙堵得更加严密。\n拍背❌❌❌\n不正确的拍背方式会震动异物，有可能会使异物把气管或食道之间的缝隙堵塞得更加严密。\n用手抠❌❌❌\n不能保证把异物从喉咙抠出来，反而可能会把位置较浅的异物推向深处。\n👉👉👉\n更多误区总结请看图2-4\n那正确的方法应该是什么呢？？？面对宝宝突如其来的意外，又想好好把握救护人员到达前的黄金时间，我们该怎么办？？？\n👇\n看这里➡️最近，阿里健康的“医鹿”app请来了“中国急救科普第一人”贾大成专家，来给宝爸宝妈们上急救课。上医鹿搜“宝宝急救课”就能免费看课。\n✌️\n贾老师，我真的要多说两句，专业力没的说，而且人还特别幽默风趣，感觉一个小时的课，不知不觉就看完了。现在一共有5节，分别是宝宝异物卡喉、割伤烫伤、流鼻血、误吃药品、急性过敏等，都是常见的宝宝危险情况。每个危险情况都会详解急救动作，道具模拟急救场景，讲解很到位。现在看课还能瓜分千元购物卡和家庭急救包，nice！',
    status: 1,
    createUser: {
      userName: 'Cindy',
    },
    follow: 10,
    like: 1000,
    comment: 100,
  }
];

export const defaultHomeLabels = [
  {
    id: '000000001',
    title: '热榜',
    describe: '标签描述',
    type: 0, // 0-首页标签，1-所有标签
  },
  {
    id: '000000002',
    title: '知识',
    describe: '标签描述2',
    type: 0, // 0-首页标签，1-所有标签
  },
  {
    id: '000000003',
    title: '职场',
    describe: '标签描述3',
    type: 0, // 0-首页标签，1-所有标签
  },
];

export const defaultLabels = [
  {
    id: '000000001',
    title: '心理学',
    describe: '标签描述',
    type: 1, // 0-首页标签，1-所有标签
  },
  {
    id: '000000002',
    title: '财经',
    describe: '标签描述2',
    type: 1, // 0-首页标签，1-所有标签
  },
  {
    id: '000000003',
    title: '时尚',
    describe: '标签描述3',
    type: 1, // 0-首页标签，1-所有标签
  },
];
